In [4]:
import pandas as pd
import numpy as np

# Create sample data with missing values, inconsistent formats, and outliers
data = {
    "Name": ["John", "Alice", "Bob", "Charlie", "David"] * 10,  # Repeat names to get 50 records
    "Age": np.random.choice([25, 30, 35, 40, np.nan], size=50),  # Random ages with missing values
    "City": ["New York", "Los Angeles", "Chicago", "San Francisco", "Seattle"] * 10,  # Repeat cities
    "Salary": np.random.randint(30000, 150000, 50)  # Random salaries
}

# Add some inconsistent city names and outliers in salary
data["City"][2] = "CHI"
data["City"][11] = "NewYork"
data["Salary"][0] = 500000

# Create DataFrame
df = pd.DataFrame(data)

# Display DataFrame
print(df)

       Name   Age           City  Salary
0      John   NaN       New York  500000
1     Alice  25.0    Los Angeles   67345
2       Bob  30.0            CHI  144321
3   Charlie  40.0  San Francisco  124108
4     David  30.0        Seattle   93349
5      John  40.0       New York  141313
6     Alice  35.0    Los Angeles   66147
7       Bob  35.0        Chicago  120917
8   Charlie  40.0  San Francisco  118658
9     David   NaN        Seattle   95882
10     John  35.0       New York   51662
11    Alice  35.0        NewYork  101882
12      Bob  35.0        Chicago  133923
13  Charlie  40.0  San Francisco   49492
14    David  40.0        Seattle   39764
15     John  30.0       New York   52434
16    Alice  30.0    Los Angeles   43552
17      Bob  30.0        Chicago   45281
18  Charlie  40.0  San Francisco  137204
19    David  40.0        Seattle   82014
20     John  25.0       New York   67817
21    Alice  40.0    Los Angeles   66018
22      Bob   NaN        Chicago  125604
23  Charlie  35.0  San Francisco   60937
24    David   NaN        Seattle  141284
25     John  30.0       New York   84745
26    Alice  35.0    Los Angeles   47590
27      Bob  25.0        Chicago   49495
28  Charlie  25.0  San Francisco   72794
29    David  40.0        Seattle  111568
30     John  25.0       New York   80453
31    Alice   NaN    Los Angeles   86716
32      Bob   NaN        Chicago   81907
33  Charlie  35.0  San Francisco   30974
34    David  30.0        Seattle   92594
35     John  35.0       New York   80754
36    Alice  40.0    Los Angeles   36173
37      Bob  35.0        Chicago   33077
38  Charlie  35.0  San Francisco  148946
39    David  25.0        Seattle  135453
40     John  30.0       New York  106942
41    Alice  25.0    Los Angeles   74235
42      Bob  35.0        Chicago  124570
43  Charlie  25.0  San Francisco   79502
44    David  40.0        Seattle   46602
45     John   NaN       New York  107578
46    Alice  35.0    Los Angeles   35288
47      Bob  35.0        Chicago  145404
48  Charlie  25.0  San Francisco   92551
49    David  25.0        Seattle  147245

In [5]:
# Save DataFrame to CSV file
df.to_csv("sample_dataset.csv", index=False)

print("Dataset saved successfully.")

Dataset saved successfully.